---
type: IExternalServer
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 5
tags: [revit-api, class]
---

# IExternalServer

`Autodesk.Revit.DB.ExternalService.IExternalServer` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDescription | 2013 | `string GetDescription ()` |
| Method | GetName | 2013 | `string GetName ()` |
| Method | GetServerId | 2013 | `Guid GetServerId ()` |
| Method | GetServiceId | 2013 | `ExternalServiceId GetServiceId ()` |
| Method | GetVendorId | 2013 | `string GetVendorId ()` |